app/controllers/questions_controller.rb

	def show
		session[:qid] = params[:id]
		@qid = session[:qid]
		@active_question = Question.find(params[:id])
		@docs = [[], []]
		@active_question.doctor_votes.each do |v|
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 0]]
SELECT "doctor_votes".* FROM "doctor_votes"  WHERE "doctor_votes"."question_id" = ?  [["question_id", 1]]
SELECT "questions".* FROM "questions"
SELECT "user_votes".* FROM "user_votes"  WHERE "user_votes"."question_id" = ?  [["question_id", 2]]

	def index
		@all_questions = Question.all.shuffle
---
SELECT "questions".* FROM "questions"

	def create_comment
		@comment = Response.new
		@comment.text = params[:text]
		@comment.is_doctor = session[:is_doctor]
		@comment.question_id = session[:qid]
		@comment.agreesNum = 0
		@comment.optionNum = params[:option]
		if session[:is_doctor]
			@comment.doctor_id = session[:id]
		else
			@comment.user_id = session[:id]
		end
		@comment.save
---
INSERT INTO "responses" ("created_at", "text", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-05-25 05:56:11.950624"], ["text", "asdfasdf"], ["updated_at", "2015-05-25 05:56:11.950624"]]

	def create
		q = params[:question]
		@new_question = Question.new
		@new_question.title = q[:title]
		@new_question.text = q[:text]
		@new_question.option1 = q[:option1]
		@new_question.option2 = q[:option2]


		@new_question.photo_link =  params[:picture].original_filename

		@pic_file = params[:picture]
		File.open(Rails.root.join('app/assets', 'images', params[:picture].original_filename), 'wb') do |f|
			f.write(@pic_file.read)
		end

		if not @new_question.save
---
INSERT INTO "questions" ("created_at", "option1", "option2", "photo_link", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def option_vote
		if(session[:id])
			if(session[:is_doctor])
				DoctorVote.create(:optionNum => params[:option],
								  :doctor_id => session[:id],
								  :question_id => session[:qid])
---
INSERT INTO "user_votes" ("created_at", "optionNum", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-05-22 05:25:01.208095"], ["optionNum", 1], ["question_id", 2], ["updated_at", "2015-05-22 05:25:01.208095"], ["user_id", 8]]

	def query_votes
		q = Question.find(session[:qid])


		user_content = "[ "
		q.user_votes.each do |v|
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]
SELECT "user_votes".* FROM "user_votes"  WHERE "user_votes"."question_id" = ?  [["question_id", 1]]