app/controllers/users_controller.rb

INSERT INTO "doctors" ("birth_date", "created_at", "docScore", "encrypted_password", "gender", "knownFor", "location", "salt", "school", "specialty", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "normal_users" ("created_at", "email", "encrypted_password", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  	def create
		f = params[:user]

		if f[:is_doctor]
			@new_user = Doctor.new
			@new_user.docScore = 100
			@new_user.specialty = "wiiiiii"
			@new_user.school = "woooo"
			@new_user.knownFor = "waaaaa"
			session[:is_doctor] = true
		else
			@new_user = NormalUser.new
			session[:is_doctor] = false
		end

		@new_user.password=(f[:password])
		@new_user.username = f[:username]
		@new_user.email = f[:email]
		if f[:password] != f[:password_confirmation] or params[:password] == ""
			flash.notice = "Passwords do not match. Please enter your password again."
			redirect_to :controller => "users", :id => @user_id, :action => "new"
		else
			@new_user.password=(f[:password])
			if @new_user.save

SELECT  "normal_users".* FROM "normal_users"  WHERE "normal_users"."username" = 'j' LIMIT 1
---
	def post_login
		f = params[:user]
		if not NormalUser.find_by_username(f[:username])